Core/src/InformationRegisters/ОграничениеЦенКонтрагента/ОграничениеЦенКонтрагента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОграничениеЦенКонтрагента</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Core/src/InformationRegisters/ОграничениеЦенКонтрагента/Forms/ФормаЗаписи/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИспользоватьХарактеристики = ПолучитьФункциональнуюОпцию("ИспользоватьХарактеристики");
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	ЗаполнитьЦену();
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	ЗаполнитьЦену();
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураПриИзменении(Элемент)
	ЗаполнитьЦену();
КонецПроцедуры

&НаКлиенте
Процедура ХарактеристикаПриИзменении(Элемент)
	ЗаполнитьЦену();
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьЦену()

	Если  
		ЗначениеЗаполнено(Запись.Период)
		И ЗначениеЗаполнено(Запись.Контрагент)
		И ЗначениеЗаполнено(Запись.Номенклатура) 
		И ЗначениеЗаполнено(Запись.Характеристика)Тогда 
		
		ЗаполнитьЦенуНаСервере();
		
	ИначеЕсли ЗначениеЗаполнено(Запись.Период)
		И ЗначениеЗаполнено(Запись.Контрагент)
		И ЗначениеЗаполнено(Запись.Номенклатура) Тогда	
		
		ЗаполнитьЦенуБезХарактеристикНаСервере();
		
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьЦенуБезХарактеристикНаСервере()

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПриходнаяНакладнаяЗапасы.Ссылка.Дата КАК Дата,
		|	ПриходнаяНакладнаяЗапасы.Цена КАК Цена
		|ПОМЕСТИТЬ ДокументыЦена
		|ИЗ
		|	Документ.ПриходнаяНакладная.Запасы КАК ПриходнаяНакладнаяЗапасы
		|ГДЕ
		|	ПриходнаяНакладнаяЗапасы.Номенклатура = &Номенклатура
		|	И ПриходнаяНакладнаяЗапасы.Ссылка.Контрагент = &Контрагент
		|	И ПриходнаяНакладнаяЗапасы.Ссылка.Дата <= &Дата
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МАКСИМУМ(ДокументыЦена.Дата) КАК Дата
		|ПОМЕСТИТЬ МаксДата
		|ИЗ
		|	ДокументыЦена КАК ДокументыЦена
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МаксДата.Дата КАК Дата,
		|	ДокументыЦена.Цена КАК Цена
		|ИЗ
		|	МаксДата КАК МаксДата
		|		ЛЕВОЕ СОЕДИНЕНИЕ ДокументыЦена КАК ДокументыЦена
		|		ПО МаксДата.Дата = ДокументыЦена.Дата";
	
	Запрос.УстановитьПараметр("Дата", Запись.Период);
	Запрос.УстановитьПараметр("Контрагент", Запись.Контрагент);
	Запрос.УстановитьПараметр("Номенклатура", Запись.Номенклатура);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Запись.Цена = ВыборкаДетальныеЗаписи.Цена
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьЦенуНаСервере()

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПриходнаяНакладнаяЗапасы.Ссылка.Дата КАК Дата,
		|	ПриходнаяНакладнаяЗапасы.Цена КАК Цена
		|ПОМЕСТИТЬ ДокументыЦена
		|ИЗ
		|	Документ.ПриходнаяНакладная.Запасы КАК ПриходнаяНакладнаяЗапасы
		|ГДЕ
		|	ПриходнаяНакладнаяЗапасы.Номенклатура = &Номенклатура
		|	И ПриходнаяНакладнаяЗапасы.Характеристика = &Характеристика
		|	И ПриходнаяНакладнаяЗапасы.Ссылка.Контрагент = &Контрагент
		|	И ПриходнаяНакладнаяЗапасы.Ссылка.Дата <= &Дата
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МАКСИМУМ(ДокументыЦена.Дата) КАК Дата
		|ПОМЕСТИТЬ МаксДата
		|ИЗ
		|	ДокументыЦена КАК ДокументыЦена
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МаксДата.Дата КАК Дата,
		|	ДокументыЦена.Цена КАК Цена
		|ИЗ
		|	МаксДата КАК МаксДата
		|		ЛЕВОЕ СОЕДИНЕНИЕ ДокументыЦена КАК ДокументыЦена
		|		ПО МаксДата.Дата = ДокументыЦена.Дата";
	
	Запрос.УстановитьПараметр("Дата", Запись.Период);
	Запрос.УстановитьПараметр("Контрагент", Запись.Контрагент);
	Запрос.УстановитьПараметр("Номенклатура", Запись.Номенклатура);
	Запрос.УстановитьПараметр("Характеристика", Запись.Характеристика);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Запись.Цена = ВыборкаДетальныеЗаписи.Цена
	КонецЦикла;
	
КонецПроцедуры
